spec/data/stripe/event_invoice_failed.json

{
    "id": "evt_invoice_failed",
    "object": "event",
    "api_version": "2018-11-08",
    "created": 1550617907,
    "data": {
        "object": {
            "id": "in_invoice_failed",
            "object": "invoice",
            "amount_due": 1000,
            "amount_paid": 1000,
            "amount_remaining": 0,
            "application_fee": null,
            "attempt_count": 1,
            "attempted": true,
            "auto_advance": false,
            "billing": "charge_automatically",
            "billing_reason": "subscription_create",
            "charge": "ch_invoice_failed",
            "currency": "usd",
            "custom_fields": null,
            "customer": "cus_customer",
            "date": 1550617907,
            "default_source": null,
            "description": null,
            "discount": null,
            "due_date": null,
            "ending_balance": 0,
            "finalized_at": 1550617907,
            "footer": null,
            "hosted_invoice_url": "https://pay.stripe.com/invoice/invst_EngLmDp6hHKmz1Vs7ZcW000L14",
            "invoice_pdf": "https://pay.stripe.com/invoice/invst_EngLmDp6hHKmz1Vs7ZcW000L14/pdf",
            "lines": {
                "object": "list",
                "data": [
                    {
                        "id": "sli_invoice_failed",
                        "object": "line_item",
                        "amount": 1000,
                        "currency": "usd",
                        "description": "1 × MyRecalls.today Annual Subscription",
                        "discountable": true,
                        "livemode": false,
                        "metadata": {},
                        "period": {
                            "end": 1582153907,
                            "start": 1550617907
                        },
                        "plan": {
                            "id": "plan_yearly_all",
                            "object": "plan",
                            "active": true,
                            "aggregate_usage": null,
                            "amount": 1000,
                            "billing_scheme": "per_unit",
                            "created": 1550617907,
                            "currency": "usd",
                            "interval": "year",
                            "interval_count": 1,
                            "livemode": false,
                            "metadata": {
                                "recalls": "true",
                                "vins": "2"
                            },
                            "nickname": "Yearly",
                            "product": "prod_my_recalls",
                            "tiers": null,
                            "tiers_mode": null,
                            "transform_usage": null,
                            "trial_period_days": null,
                            "usage_type": "licensed"
                        },
                        "proration": false,
                        "quantity": 1,
                        "subscription": "all_subscription",
                        "subscription_item": "si_subscribe_yearly",
                        "type": "subscription"
                    }
                ],
                "has_more": false,
                "total_count": 1,
                "url": "/v1/invoices/in_invoice_failed/lines"
            },
            "livemode": false,
            "metadata": {},
            "next_payment_attempt": null,
            "number": "16F25C8-0001",
            "paid": true,
            "period_end": 1550617907,
            "period_start": 1550617907,
            "receipt_number": null,
            "starting_balance": 0,
            "statement_descriptor": null,
            "status": "open",
            "subscription": "all_subscription",
            "subtotal": 1000,
            "tax": null,
            "tax_percent": null,
            "total": 1000,
            "webhooks_delivered_at": null
        }
    },
    "livemode": false,
    "pending_webhooks": 0,
    "request": {
        "id": "req_invoice_failed",
        "idempotency_key": null
    },
    "type": "invoice.payment_failed"
}