spec/data/stripe/event_subscription_deleted.json

{
    "id": "evt_1FM4jUG3NpevIf9mrgf3flSn",
    "object": "event",
    "api_version": "2018-11-08",
    "created": 1569295832,
    "data": {
        "object": {
            "id": "all_subscription",
            "object": "subscription",
            "application_fee_percent": null,
            "billing": "charge_automatically",
            "billing_cycle_anchor": 1569295801,
            "billing_thresholds": null,
            "cancel_at": null,
            "cancel_at_period_end": false,
            "canceled_at": 1569295832,
            "collection_method": "charge_automatically",
            "created": 1569295801,
            "current_period_end": 1600918201,
            "current_period_start": 1569295801,
            "customer": "cus_customer",
            "days_until_due": null,
            "default_payment_method": null,
            "default_source": null,
            "default_tax_rates": [],
            "discount": null,
            "ended_at": 1569295832,
            "items": {
                "object": "list",
                "data": [
                    {
                        "id": "si_subscription",
                        "object": "subscription_item",
                        "billing_thresholds": null,
                        "created": 1569295802,
                        "metadata": {},
                        "plan": {
                            "id": "plan_yearly_all",
                            "object": "plan",
                            "active": true,
                            "aggregate_usage": null,
                            "amount": 1500,
                            "amount_decimal": "1500",
                            "billing_scheme": "per_unit",
                            "created": 1559679238,
                            "currency": "usd",
                            "interval": "year",
                            "interval_count": 1,
                            "livemode": false,
                            "metadata": {
                                "recalls": "true",
                                "vins": "2"
                            },
                            "nickname": "Recalls and VINs",
                            "product": "prod_my_recalls",
                            "tiers": null,
                            "tiers_mode": null,
                            "transform_usage": null,
                            "trial_period_days": null,
                            "usage_type": "licensed"
                        },
                        "quantity": 1,
                        "subscription": "all_subscription",
                        "tax_rates": []
                    }
                ],
                "has_more": false,
                "total_count": 1,
                "url": "/v1/subscription_items?subscription=all_subscription"
            },
            "latest_invoice": "in_1FM4izG3NpevIf9m4KmT4S6N",
            "livemode": false,
            "metadata": {},
            "pending_setup_intent": null,
            "plan": {
                "id": "plan_yearly_all",
                "object": "plan",
                "active": true,
                "aggregate_usage": null,
                "amount": 1500,
                "amount_decimal": "1500",
                "billing_scheme": "per_unit",
                "created": 1559679238,
                "currency": "usd",
                "interval": "year",
                "interval_count": 1,
                "livemode": false,
                "metadata": {
                    "recalls": "true",
                    "vins": "2"
                },
                "nickname": "Recalls and VINs",
                "product": "prod_EWbGcQgIp9weCB",
                "tiers": null,
                "tiers_mode": null,
                "transform_usage": null,
                "trial_period_days": null,
                "usage_type": "licensed"
            },
            "quantity": 1,
            "schedule": null,
            "start": 1569295801,
            "start_date": 1569295801,
            "status": "canceled",
            "tax_percent": null,
            "trial_end": null,
            "trial_start": null
        }
    },
    "livemode": false,
    "pending_webhooks": 1,
    "request": {
        "id": "req_qiXSNDrZ98a6O7",
        "idempotency_key": null
    },
    "type": "customer.subscription.deleted"
}
