spec/data/stripe/event_subscription_updated.json

{
    "id": "evt_1FNQSxG3NpevIf9mUZdZ7aMH",
    "object": "event",
    "api_version": "2018-11-08",
    "created": 1569617703,
    "data": {
        "object": {
            "id": "all_subscription",
            "object": "subscription",
            "application_fee_percent": null,
            "billing": "charge_automatically",
            "billing_cycle_anchor": 1569617694,
            "billing_thresholds": null,
            "cancel_at": 1601240094,
            "cancel_at_period_end": true,
            "canceled_at": 1569617703,
            "collection_method": "charge_automatically",
            "created": 1569617694,
            "current_period_end": 1601240094,
            "current_period_start": 1569617694,
            "customer": "cus_customer",
            "days_until_due": null,
            "default_payment_method": null,
            "default_source": null,
            "default_tax_rates": [],
            "discount": null,
            "ended_at": null,
            "items": {
                "object": "list",
                "data": [
                    {
                        "id": "si_FtCsoztf0upx8P",
                        "object": "subscription_item",
                        "billing_thresholds": null,
                        "created": 1569617695,
                        "metadata": {},
                        "plan": {
                            "id": "plan_yearly_all",
                            "object": "plan",
                            "active": true,
                            "aggregate_usage": null,
                            "amount": 1500,
                            "amount_decimal": "1500",
                            "billing_scheme": "per_unit",
                            "created": 1559679238,
                            "currency": "usd",
                            "interval": "year",
                            "interval_count": 1,
                            "livemode": false,
                            "metadata": {
                                "recalls": "true",
                                "vins": "2"
                            },
                            "nickname": "Recalls and VINs",
                            "product": "prod_my_recalls",
                            "tiers": null,
                            "tiers_mode": null,
                            "transform_usage": null,
                            "trial_period_days": null,
                            "usage_type": "licensed"
                        },
                        "quantity": 1,
                        "subscription": "all_subscription",
                        "tax_rates": []
                    }
                ],
                "has_more": false,
                "total_count": 1,
                "url": "/v1/subscription_items?subscription=all_subscription"
            },
            "latest_invoice": "in_1FNQSoG3NpevIf9msaDZENM4",
            "livemode": false,
            "metadata": {},
            "pending_setup_intent": null,
            "plan": {
                "id": "plan_yearly_all",
                "object": "plan",
                "active": true,
                "aggregate_usage": null,
                "amount": 1500,
                "amount_decimal": "1500",
                "billing_scheme": "per_unit",
                "created": 1559679238,
                "currency": "usd",
                "interval": "year",
                "interval_count": 1,
                "livemode": false,
                "metadata": {
                    "recalls": "true",
                    "vins": "2"
                },
                "nickname": "Recalls and VINs",
                "product": "prod_my_recalls",
                "tiers": null,
                "tiers_mode": null,
                "transform_usage": null,
                "trial_period_days": null,
                "usage_type": "licensed"
            },
            "quantity": 1,
            "schedule": null,
            "start": 1569617703,
            "start_date": 1569617694,
            "status": "active",
            "tax_percent": null,
            "trial_end": null,
            "trial_start": null
        },
        "previous_attributes": {
            "cancel_at": null,
            "cancel_at_period_end": false,
            "canceled_at": null,
            "start": 1569617694
        }
    },
    "livemode": false,
    "pending_webhooks": 1,
    "request": {
        "id": "req_CTVw9LBCkvKYr4",
        "idempotency_key": null
    },
    "type": "customer.subscription.updated"
}
